# ColorDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..ColorDepth Property
PDFExportOptions Class See Also
---
Color depth of either black/white, gray scale or color.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ColorDepthType ColorDepth { get; set; }
```

Visual Basic
---
```text
Public Property ColorDepth As ColorDepthType
	Get
	Set
```

Visual C++
---
```text
public:
property ColorDepthType ColorDepth {
	ColorDepthType get ();
	void set (ColorDepthType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace